"Please Donate" = "Donera gärna";
"Donate" = "Donera";
"This is free software, but it still costs money to write, support, and distribute it. If you enjoy using it, please consider a donation to the authors of this software. It will help to make Cyberduck even better!" = "Det har tagit många nätter att utveckla detta program. Om du gillar det, överväg att ge en donation till upphovsmannen. Det bidrar till att göra Cyberduck ännu bättre!";
"As a contributor to Cyberduck, you receive a registration key that disables this prompt." = "Som bidragsgivare till Cyberduck får du en donationsnyckel som stänger av det här meddelandet.";
"Thank you for using Cyberduck!" = "Tack för att du använder Cyberduck!";

"Later" = "Senare";
"Don't show again for this version" = "Visa inte igen för den här versionen";
"Registration Key" = "Registreringsnyckel";

"Buy in Windows Store" = "Buy in Windows Store";
"Buy in Mac App Store" = "Buy in Mac App Store";


